Revit 2026 API

# LinkVisibility Enumeration

---

Link visibility types.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LinkVisibility
```
```vb
Public Enumeration LinkVisibility
```
```cpp
public enum class LinkVisibility
```
```fsharp
type LinkVisibility
```

| Member name | Value | Description |
| --- | --- | --- |
| ByHostView | 0 |  |
| ByLinkView | 1 |  |
| Custom | 2 |  |

#### Reference

Autodesk.Revit.DB Namespace